
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	// регистр ТоварыНаСкладе Расход
	Движения.ТоварыНаСкладе.Записать();
	Движения.ТоварыНаСкладе.Записывать = Истина;
	
	// регистр РезервыТоваров Расход
	Движения.РезервыТоваров.Записывать = Истина;
	
	// регистр ВзаиморасчетыСПокупателями Расход
	Движения.ВзаиморасчетыСПокупателями.Записывать = Истина;

	// регистр ПродажиПоМенеджерам Расход
	Движения.ПродажиПоМенеджерам.Записывать = Истина; 
	
	ТаблицаБлокировки = Новый ТаблицаЗначений;
	ТаблицаБлокировки.Колонки.Добавить("Номенклатура");
	
	ТаблицаБлокировки.ЗагрузитьКолонку(Товары.ВыгрузитьКолонку("Товар"), "Номенклатура"); 
	
	Блокировка = Новый БлокировкаДанных;
	
	Элемент = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладе");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.ИсточникДанных = ТаблицаБлокировки;
	Элемент.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
	Блокировка.Заблокировать();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТовары.Товар КАК Товар,
		|	СУММА(РеализацияТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.Реализация.Товары КАК РеализацияТовары
		|ГДЕ
		|	РеализацияТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТовары.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Товар КАК Товар,
		|	ВТ_Товары.Товар.Представление КАК ТоварПредставление,
		|	ВТ_Товары.Количество КАК КоличествоДокумент,
		|	ЕСТЬNULL(ТоварыНаСкладеОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ТоварыНаСкладеОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РезервыТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоРезерв,
		|	ЕСТЬNULL(РезервыТоваровОстаткиДругие.КоличествоОстаток, 0) КАК КоличествоРезервДругие
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладе.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ_Товары.Товар КАК Товар
		|					ИЗ
		|						ВТ_Товары КАК ВТ_Товары)) КАК ТоварыНаСкладеОстатки
		|		ПО ВТ_Товары.Товар = ТоварыНаСкладеОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТоваров.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ_Товары.Товар КАК Товар
		|						ИЗ
		|							ВТ_Товары КАК ВТ_Товары)
		|					И ЗаказПокупателя = &ДокументОснование) КАК РезервыТоваровОстатки
		|		ПО ВТ_Товары.Товар = РезервыТоваровОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТоваров.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ_Товары.Товар КАК Товар
		|						ИЗ
		|							ВТ_Товары КАК ВТ_Товары)
		|					И ЗаказПокупателя <> &ДокументОснование) КАК РезервыТоваровОстаткиДругие
		|		ПО ВТ_Товары.Товар = РезервыТоваровОстаткиДругие.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоДокумент - Выборка.КоличествоРезервДругие > Выборка.КоличествоОстаток Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ("Не хватает товара "
									+ Выборка.ТоварПредставление
									+ ". Остаток товара:  "
									+ (Выборка.КоличествоОстаток - Выборка.КоличествоРезервДругие));
			Сообщение.Сообщить();
			
			Отказ = Истина;
		
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			Если Выборка.КоличествоДокумент = Выборка.КоличествоОстаток Тогда
				СуммаСписания = Выборка.СуммаОстаток;
			Иначе
				СуммаСписания = Выборка.СуммаОстаток / Выборка.КоличествоОстаток * Выборка.КоличествоДокумент;
			КонецЕсли;
			
			// регистр ТоварыНаСкладе Расход
			Движение = Движения.ТоварыНаСкладе.Добавить();
			
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Период 			= Дата;
			Движение.Номенклатура 		= Выборка.Товар;
			Движение.Количество 		= Выборка.КоличествоДокумент;
			Движение.Сумма				= СуммаСписания;
			Движение.Контрагент        	= Контрагент;
			
			// регистр РезервыТоваров Расход
			Движение = Движения.РезервыТоваров.Добавить();
			
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Период 			= Дата;
			Движение.ЗаказПокупателя	= ДокументОснование;
			Движение.Номенклатура 		= Выборка.Товар;
			
			Если Выборка.КоличествоРезерв < Выборка.КоличествоДокумент Тогда
				Движение.Количество = Выборка.КоличествоРезерв;
            Иначе
				Движение.Количество = Выборка.КоличествоДокумент;				
			КонецЕсли;

			
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		
		// регистр ВзаиморасчетыСПокупателями Расход
		Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Сумма = Товары.Итог("Сумма");
		
		// регистр ПродажиПоМенеджерам
		Движение = Движения.ПродажиПоМенеджерам.Добавить();
		Движение.Период = Дата;	
		Движение.Менеджер = Менеджер;		
		Движение.Сумма = Товары.Итог("Сумма");
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!! 
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РезервированиеТоваров") Тогда
		
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл 
			
			НоваяСтрока = Товары.Добавить();
			
			НоваяСтрока.Количество 	= ТекСтрокаТовары.Количество;
			НоваяСтрока.Сумма 		= ТекСтрокаТовары.Сумма;
			НоваяСтрока.Товар 		= ТекСтрокаТовары.Товар;
			НоваяСтрока.Цена 		= ТекСтрокаТовары.Цена;
			
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
