
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!! 
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	// регистр ТоварыНаСкладе Расход
	Движения.ТоварыНаСкладе.Записать();
	Движения.ТоварыНаСкладе.Записывать = Истина;
	
	ТаблицаБлокировки = Новый ТаблицаЗначений;
	ТаблицаБлокировки.Колонки.Добавить("Номенклатура");
	
	ТаблицаБлокировки.ЗагрузитьКолонку(Товары.ВыгрузитьКолонку("Товар"), "Номенклатура"); 
	
	Блокировка = Новый БлокировкаДанных;
	
	Элемент = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладе");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.ИсточникДанных = ТаблицаБлокировки;
	Элемент.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
	Блокировка.Заблокировать();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТовары.Товар КАК Товар,
		|	СУММА(РеализацияТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.Реализация.Товары КАК РеализацияТовары
		|ГДЕ
		|	РеализацияТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТовары.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Товар КАК Товар,
		|	ВТ_Товары.Товар.Представление КАК ТоварПредставление,
		|	ВТ_Товары.Количество КАК КоличествоДокумент,
		|	ЕСТЬNULL(ТоварыНаСкладеОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ТоварыНаСкладеОстатки.СуммаОстаток, 0) КАК СуммаОстаток
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладе.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ_Товары.Товар КАК Товар
		|					ИЗ
		|						ВТ_Товары КАК ВТ_Товары)) КАК ТоварыНаСкладеОстатки
		|		ПО ВТ_Товары.Товар = ТоварыНаСкладеОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоДокумент > Выборка.КоличествоОстаток Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает товара " + Выборка.ТоварПредставление + ". Остаток товара:  " + Выборка.КоличествоОстаток;
			Сообщение.Сообщить();
			
			Отказ = Истина;
		
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			Если Выборка.КоличествоДокумент = Выборка.КоличествоОстаток Тогда
				СуммаСписания = Выборка.СуммаОстаток;
			Иначе
				СуммаСписания = Выборка.СуммаОстаток / Выборка.КоличествоОстаток * Выборка.КоличествоДокумент;
			КонецЕсли;
			
			Движение = Движения.ТоварыНаСкладе.Добавить();
			
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Период 			= Дата;
			Движение.Номенклатура 		= Выборка.Товар;
			Движение.Количество 		= Выборка.КоличествоДокумент;
			Движение.Сумма				= СуммаСписания;
			
		КонецЕсли;
	КонецЦикла;	                                                 	
КонецПроцедуры
