#Область ОбработчикиСобытийТабЧастиТовары

// Обработчик изменения количества в табличной части Товары
//
// Параметры:
//   Элемент - ЭлементФормы - Элемент управления, вызвавший событие
//
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущаяСрока = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСумму(ТекущаяСрока);
КонецПроцедуры

// Обработчик изменения цены в табличной части Товары
//
// Параметры:
//   Элемент - ЭлементФормы - Элемент управления, вызвавший событие
//
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущаяСрока = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСумму(ТекущаяСрока);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

// Рассчитывает сумму по количеству и цене для строки табличной части
//
// Параметры:
//   ТекущаяСтрока - ДанныеФормыЭлементКоллекции - Строка табличной части Товары
//
&НаКлиенте
Процедура РассчитатьСумму(ТекущаяСтрока)
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
КонецПроцедуры 

#КонецОбласти
