#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.Вариант = ВариантСтандартногоПериода.ЭтотГод;
	ОбновитьДиаграммыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОбновитьДиаграммыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

 &НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДиаграммыНаСервере();
КонецПроцедуры 
		
#КонецОбласти 
	
#Область СлужебныеПрооцедурыИФункции
	
&НаСервере
Процедура ОбновитьДиаграммыНаСервере()
	
	ОбновитьДиаграммуЗаказыПоМесяцам();
	ОбновитьДиаграммуПродажиПоКонтрагентам();
	ОбновитьДиаграммуДинамикаПродаж();
	ОбновитьДиаграммуПродажиПоМенеджерам();	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуЗаказыПоМесяцам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Реализация.Ссылка) КАК КоличествоЗаказов,
		|	НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ) КАК Месяц
		|ИЗ
		|	Документ.Реализация КАК Реализация
		|ГДЕ
		|	Реализация.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Реализация.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	
	ДанныеПоЗаказам = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеПоЗаказам.Вставить(Выборка.Месяц, Выборка.КоличествоЗаказов);
	КонецЦикла;
	
	ЗаказыПоМесям.Очистить();
	Серия = ЗаказыПоМесям.УстановитьСерию("Количество заказов");
	
	Месяц = Период.ДатаНачала;
	
	Пока Месяц <= Период.ДатаОкончания Цикл
		
		Точка = ЗаказыПоМесям.УстановитьТочку(Месяц);
		Точка.Текст = Формат(Месяц, "ДФ='MMMM yyyy'");
		
		КоличествоЗаказов = ?(ДанныеПоЗаказам[Месяц] <> Неопределено, ДанныеПоЗаказам[Месяц], 0);
		
		ЗаказыПоМесям.УстановитьЗначение(Точка, Серия, КоличествоЗаказов);
		
		Месяц = ДобавитьМесяц(Месяц, 1);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуДинамикаПродаж()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладеОбороты.Период КАК Период,
		|	ТоварыНаСкладеОбороты.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладе.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК ТоварыНаСкладеОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	СУММА(СуммаОборот)
		|ПО
		|	Период ПЕРИОДАМИ(МЕСЯЦ, &НачалоПериода, &КонецПериода)";
	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПериод = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");
		
	ДинамикаПродаж.Очистить();
	Серия = ДинамикаПродаж.УстановитьСерию("Сумма продаж");
	
	Пока ВыборкаПериод.Следующий() Цикл
		
		Точка = ДинамикаПродаж.УстановитьТочку(ВыборкаПериод.Период);
		Точка.Текст = Формат(ВыборкаПериод.Период, "ДФ='MMMM yyyy'");
		
		ДинамикаПродаж.УстановитьЗначение(Точка, Серия, ВыборкаПериод.СуммаОборот);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуПродажиПоМенеджерам()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажиПоМенеджерамОбороты.Менеджер КАК Менеджер,
		|	ПродажиПоМенеджерамОбороты.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрНакопления.ПродажиПоМенеджерам.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПродажиПоМенеджерамОбороты";
	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПродажиПоМенеджерам.Очистить();
	Точка = ПродажиПоМенеджерам.УстановитьТочку("Сумма продаж");
	
	Пока Выборка.Следующий() Цикл
		
		Серия = ПродажиПоМенеджерам.УстановитьСерию(Выборка.Менеджер);
		
		ПродажиПоМенеджерам.УстановитьЗначение(Точка, Серия, Выборка.СуммаОборот);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуПродажиПоКонтрагентам()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладеОбороты.Контрагент КАК Контрагент,
		|	ТоварыНаСкладеОбороты.СуммаРасход КАК Сумма
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладе.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ТоварыНаСкладеОбороты";
	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПродажиПоКонтрагентам.Очистить();
	Точка = ПродажиПоКонтрагентам.УстановитьТочку("Сумма продаж");
	
	Пока Выборка.Следующий() Цикл
		
		Серия = ПродажиПоКонтрагентам.УстановитьСерию(Выборка.Контрагент);
		ПродажиПоКонтрагентам.УстановитьЗначение(Точка, Серия, Выборка.Сумма);	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти