#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ТекущийОбъект.Проведен Тогда
		Элементы.Услуги.ТолькоПросмотр = Истина;
		Элементы.Клиент.ТолькоПросмотр = Истина;
		Элементы.Клиент.КнопкаОткрытия = Ложь;
	Иначе
		Элементы.Услуги.ТолькоПросмотр = Ложь;
		Элементы.Клиент.ТолькоПросмотр = Ложь;
		Элементы.Клиент.КнопкаОткрытия = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабЧастиУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущаяСрока = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуУслуги(ТекущаяСрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущаяСрока = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуУслуги(ТекущаяСрока);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

&НаКлиенте
Процедура РассчитатьСуммуУслуги(ТекущаяСтрока)
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
КонецПроцедуры

#КонецОбласти
