
Процедура ПриЗаписи(Отказ)
	
	Если НЕ Согласованно Тогда
		
		НовоеСогласование = БизнесПроцессы.СогласованиеОтпуска.СоздатьБизнесПроцесс();
		
		НовоеСогласование.Дата 						= ТекущаяДатаСеанса();
		НовоеСогласование.Сотрудник 				= Сотрудник;
		НовоеСогласование.ДатаНачалаОтпуска 		= ДатаНачалаОтпуска;
		НовоеСогласование.ДатаОкончанияОтпуска 		= ДатаОкончанияОтпуска;
		НовоеСогласование.ДокументОснование 		= Ссылка;
		
		НовоеСогласование.Записать();
		
		НовоеСогласование.Старт();
		
	КонецЕсли;
	
КонецПроцедуры

