
Процедура ЗавершениеССогласованиемПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗаявлениеНаОтпуск = ДокументОснование.ПолучитьОбъект();
	
	ЗаявлениеНаОтпуск.Согласованно = Истина; 
	
	Движение = РегистрыСведений.ГрафикОтпусков.СоздатьМенеджерЗаписи();
	
	Движение.Сотрудник 		= ЗаявлениеНаОтпуск.Сотрудник;
	Движение.ВОтпускеС 		= ЗаявлениеНаОтпуск.ДатаНачалаОтпуска;
	Движение.ВОтпускеПо 	= ЗаявлениеНаОтпуск.ДатаОкончанияОтпуска;
	
	Движение.Записать();
	
	УведомлениеДляПользователя(ЗаявлениеНаОтпуск.Сотрудник, ДокументОснование, "Согласованно ");
	
	ЗаявлениеНаОтпуск.Записать();
			
КонецПроцедуры

Процедура СогласованноСРуководителемПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат) 
	
	Результат = СогласованноРуководителем;
	
КонецПроцедуры

Процедура СогласованноСHRПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
		
	Результат = СогласованноHR;
	
КонецПроцедуры

Процедура СогласованиеСРуководителемПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Исполнитель = ФормируемыеЗадачи[0].БизнесПроцесс.Сотрудник.Руководитель;
	ФормируемыеЗадачи[0].СрокВыполнения = КонецДня((ТекущаяДатаСеанса() + 86400));	
КонецПроцедуры

Процедура УведомлениеДляПользователя(Сотрудник, Документ, Результат)

	ЗадачаУведомление = Задачи.ЗадачаСотрудника.СоздатьЗадачу();
	
    ЗадачаУведомление.Наименование		= "Ознакомиться с результатом: " + Результат + Документ;
	ЗадачаУведомление.Исполнитель 		= Сотрудник;
	ЗадачаУведомление.Дата 				= ТекущаяДатаСеанса();
	ЗадачаУведомление.СрокВыполнения 	= ТекущаяДатаСеанса() + 86400;  
	
	ЗадачаУведомление.Записать();

КонецПроцедуры


Процедура ЗавершениеНеСогласованноПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявлениеНаОтпуск.Сотрудник КАК Сотрудник,
		|	ЗаявлениеНаОтпуск.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявлениеНаОтпуск КАК ЗаявлениеНаОтпуск
		|ГДЕ
		|	ЗаявлениеНаОтпуск.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		УведомлениеДляПользователя(Выборка.Сотрудник, Выборка.Ссылка, "Не Согласованно ");	
	КонецЕсли;;	
	
КонецПроцедуры


Процедура ПодтверждениеHRПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].СрокВыполнения = КонецДня((ТекущаяДатаСеанса() + 86400));
КонецПроцедуры


Процедура ПодтверждениеHRПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если НЕ ЗначениеЗаполнено(Задача.Исполнитель) Тогда
		ОбъектЗадача = Задача.ПолучитьОбъект();
		ОбъектЗадача.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
		ОбъектЗадача.Записать();
	КонецЕсли;
КонецПроцедуры

