
Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗаявлениеНаОтпуск = ДокументОснование.ПолучитьОбъект();
	
	ЗаявлениеНаОтпуск.Согласованно = Истина; 
	
	Движение = РегистрыСведений.ГрафикОтпусков.СоздатьМенеджерЗаписи();
	
	Движение.Сотрудник 		= ЗаявлениеНаОтпуск.Сотрудник;
	Движение.ВОтпускеС 		= ЗаявлениеНаОтпуск.ДатаНачалаОтпуска;
	Движение.ВОтпускеПо 	= ЗаявлениеНаОтпуск.ДатаОкончанияОтпуска;
	
	Движение.Записать();
	
	ЗаявлениеНаОтпуск.Записать();
		
КонецПроцедуры

Процедура СогласованноСРуководителемПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат) 

	Если СогласованноРуководителем Тогда
		Текст = "Отпуск согласовал - Руководитель"; 
		Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
	ИначеЕсли НЕ СогласованноРуководителем Тогда
		Текст = "Не согласовал отпуск - Руководитель";
		Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
	КонецЕсли;
	
	Результат = СогласованноРуководителем;
	//УведомлениеДляПользователя(Текст, Картинка, СтатусОповещенияПользователя.Важное);
	
КонецПроцедуры

Процедура СогласованноСHRПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если СогласованноHR Тогда
		Текст = "Отпуск согласовал - HR";
		Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
	ИначеЕсли НЕ СогласованноHR Тогда
		Текст = "Не согласовал отпуск - HR";
		Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
	КонецЕсли;
	
	Результат = СогласованноHR;
	//УведомлениеДляПользователя(Текст, Картинка, СтатусОповещенияПользователя.Важное);
	
КонецПроцедуры

Процедура СогласованиеСРуководителемПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Исполнитель = ФормируемыеЗадачи[0].БизнесПроцесс.Сотрудник.Руководитель;
	ФормируемыеЗадачи[0].СрокВыполнения = КонецДня((ТекущаяДатаСеанса() + 86400));	
КонецПроцедуры


&НаКлиенте
Процедура УведомлениеДляПользователя(Текст, Картинка, Статус)

	ПоказатьОповещениеПользователя(Текст,,,Картинка, Статус);


КонецПроцедуры
