
Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗаявлениеНаОтпуск = ДокументОснование.ПолучитьОбъект();
	
	ЗаявлениеНаОтпуск.Согласованно = Истина; 
	
	Движение = РегистрыСведений.ГрафикОтпусков.СоздатьМенеджерЗаписи();
	
	Движение.Сотрудник 		= ЗаявлениеНаОтпуск.Сотрудник;
	Движение.ВОтпускеС 		= ЗаявлениеНаОтпуск.ДатаНачалаОтпуска;
	Движение.ВОтпускеПо 	= ЗаявлениеНаОтпуск.ДатаОкончанияОтпуска;
	
	Движение.Записать();
	
	ЗаявлениеНаОтпуск.Записать();
		
КонецПроцедуры

Процедура СогласованноСРуководителемПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат) 
	
	Результат = СогласованноРуководителем;
	
КонецПроцедуры

Процедура СогласованноСHRПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)	
	
	Результат = СогласованноHR; 
	
КонецПроцедуры

Процедура СогласованиеСРуководителемПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Исполнитель = ФормируемыеЗадачи[0].БизнесПроцесс.Сотрудник.Руководитель;
КонецПроцедуры
