
Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗаявлениеНаОтпуск = ДокументОснование.ПолучитьОбъект();
	
	ЗаявлениеНаОтпуск.Согласованно = Истина; 
	
	Движение = РегистрыСведений.ГрафикОтпусков.СоздатьМенеджерЗаписи();
	
	Движение.Сотрудник 		= ЗаявлениеНаОтпуск.Сотрудник;
	Движение.ВОтпускеС 		= ЗаявлениеНаОтпуск.ДатаНачалаОтпуска;
	Движение.ВОтпускеПо 	= ЗаявлениеНаОтпуск.ДатаОкончанияОтпуска;
	
	Движение.Записать();
	
	ЗаявлениеНаОтпуск.Записать();
		
КонецПроцедуры
