
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	// регистр РезервыТоваров Приход
	Движения.РезервыТоваров.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервированиеТоваровТовары.Товар КАК Товар,
		|	СУММА(РезервированиеТоваровТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.РезервированиеТоваров.Товары КАК РезервированиеТоваровТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	РезервированиеТоваровТовары.Товар";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.РезервыТоваров.Добавить();
		
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.ЗаказПокупателя 	= Ссылка;
		Движение.Период 			= Дата;
		Движение.Номенклатура 		= Выборка.Товар;
		Движение.Количество 		= Выборка.Количество;
		
	КонецЦикла;

КонецПроцедуры
