
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьСписокРолей();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРолей(ПользовательИБ = Неопределено)
	
	Для каждого Роль Из Метаданные.Роли Цикл
		
		РольНазначенаПользователю = ?(ПользовательИБ = Неопределено,
										Ложь,
										ПользовательИБ.Роли.Содержит(Роль));
										
		СписокРолей.Добавить(Роль.Имя, Роль.Синоним, РольНазначенаПользователю);
		
	
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ТекущийОбъект.ИдентификаторПользователяИБ);
		
	Если ПользовательИБ <> Неопределено и ПользовательИБ.ПарольУстановлен Тогда
		Пароль = Новый УникальныйИдентификатор;		
	КонецЕсли;
	
	ЗаполнитьСписокРолей(ПользовательИБ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
	Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура СписокРолейПометкаПриИзменении(Элемент)
	РолиИзменены = Истина;
	Модифицированность = Истина;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если РолиИзменены Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СписокРолей", СписокРолей);	
	КонецЕсли;
	
	Если ПарольИзменен Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Пароль", Пароль);	
	КонецЕсли;
	

	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РолиИзменены = Ложь;
	ПарольИзменен = Ложь;
КонецПроцедуры

