
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
		
		Если ПользовательИБ = Неопределено Тогда 
			
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
			ОбновитьДанныеПользователяИБ(ПользовательИБ);
			
			ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
			
		Иначе
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Пользователь с таким именем уже существует!";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		Если ПользовательИБ <> Неопределено Тогда 
			ОбновитьДанныеПользователяИБ(ПользовательИБ);	
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

Процедура ОбновитьДанныеПользователяИБ(ПользовательИБ)
	
	ПользовательИБ.Имя = Наименование;
	ПользовательИБ.ПолноеИмя = ПолноеИмя;
	ПользовательИБ.ПоказыватьВСпискеВыбора = ПоказыватьВСпискеВыбора;

	Если ДополнительныеСвойства.Свойство("СписокРолей") Тогда
		ПользовательИБ.Роли.Очистить();
		СписокРолей = ДополнительныеСвойства.СписокРолей;
		Для каждого Роль Из СписокРолей Цикл
			Если Роль.Пометка Тогда
				ИмяРоли = Роль.Значение;
				ПользовательИБ.Роли.Добавить(Метаданные.Роли[ИмяРоли]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Пароль") Тогда
		ПользовательИБ.Пароль = ДополнительныеСвойства.Пароль;	
	КонецЕсли;
	
	ПользовательИБ.Записать();

КонецПроцедуры

