 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
КонецПроцедуры
 
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ОформлениеПросроченнойЗадачи = УсловноеОформление.Элементы.Добавить();
	
	ОформлениеПросроченнойЗадачи.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Бирюзовый);
	
	ЭлементУсловия = ОформлениеПросроченнойЗадачи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементУсловия.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Список.СрокВыполнения");
	ЭлементУсловия.ВидСравнения 		= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементУсловия.ПравоеЗначение		= ТекущаяДатаСеанса();
	ЭлементУсловия.Использование		= Истина;
	
	ЭлементУсловия = ОформлениеПросроченнойЗадачи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементУсловия.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Список.Выполнена");
	ЭлементУсловия.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение		= Ложь;
	ЭлементУсловия.Использование		= Истина;

	
	ОформляемоеПоле = ОформлениеПросроченнойЗадачи.Поля.Элементы.Добавить();
	
	ОформляемоеПоле.Поле 			= Новый ПолеКомпоновкиДанных("Список");
	ОформляемоеПоле.Использование 	= Истина;
	
	ОформлениеПросроченнойЗадачи.Использование = Истина;
	
КонецПроцедуры // ()



