
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Объект.Сотрудник = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	
	ЗагрузитьИсториюСогласований();
	
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьИсториюСогласований() 
	
	ИсторияСогласований.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияСогласованийОтпусков.Этап КАК Этап,
		|	ИсторияСогласованийОтпусков.Исполнитель КАК Исполнитель,
		|	ИсторияСогласованийОтпусков.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ИсторияСогласованийОтпусков КАК ИсторияСогласованийОтпусков
		|ГДЕ
		|	ИсторияСогласованийОтпусков.Документ = &Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ИсторияСогласований.Добавить();
		
		НоваяСтрока.Этап			= Выборка.Этап;
		НоваяСтрока.Исполнитель		= Выборка.Исполнитель;
		НоваяСтрока.Дата  			= Выборка.Дата;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьИсториюНаСервере()
	ЗагрузитьИсториюСогласований();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИсторию(Команда)
	ОбновитьИсториюНаСервере();
КонецПроцедуры
